<H1 style="color:#64ff33; font-size:34px;background:#222 ; border-radius:15px ; text-align:center ;padding:20px"> Updating Rows and Columns</H1>

In [33]:
import pandas as pd

In [34]:
df=pd.read_csv('/home/geek/Desktop/DE/data/LOTR.csv')
df

   FellowshipID FirstName     Skills
0          1001     Frodo     Hiding
1          1002   Samwise  Gardening
2          1003   Gandalf     Spells
3          1004    Pippin  Fireworks

In [35]:
df.columns

Index(['FellowshipID', 'FirstName', 'Skills'], dtype='object')

In [36]:
df.columns=['Fellow__ship__ID', 'First__Name', 'Skills']
df

   Fellow__ship__ID First__Name     Skills
0              1001       Frodo     Hiding
1              1002     Samwise  Gardening
2              1003     Gandalf     Spells
3              1004      Pippin  Fireworks

In [37]:
df.columns=[name.upper() for name in df.columns]
df

   FELLOW__SHIP__ID FIRST__NAME     SKILLS
0              1001       Frodo     Hiding
1              1002     Samwise  Gardening
2              1003     Gandalf     Spells
3              1004      Pippin  Fireworks

In [38]:
df.columns=[name.replace('__' , '*') for name in df.columns]
df

   FELLOW*SHIP*ID FIRST*NAME     SKILLS
0            1001      Frodo     Hiding
1            1002    Samwise  Gardening
2            1003    Gandalf     Spells
3            1004     Pippin  Fireworks

In [39]:
df.rename(columns={'SKILLS':'PERSONNEL_SKILLS'},inplace=True)
df

   FELLOW*SHIP*ID FIRST*NAME PERSONNEL_SKILLS
0            1001      Frodo           Hiding
1            1002    Samwise        Gardening
2            1003    Gandalf           Spells
3            1004     Pippin        Fireworks

# update data

In [40]:
df.iloc[0]=[1000,'Ramzi','data analysis']
df

   FELLOW*SHIP*ID FIRST*NAME PERSONNEL_SKILLS
0            1000      Ramzi    data analysis
1            1002    Samwise        Gardening
2            1003    Gandalf           Spells
3            1004     Pippin        Fireworks

In [41]:
df.loc[1,'FIRST*NAME']='hadrouk'
df

   FELLOW*SHIP*ID FIRST*NAME PERSONNEL_SKILLS
0            1000      Ramzi    data analysis
1            1002    hadrouk        Gardening
2            1003    Gandalf           Spells
3            1004     Pippin        Fireworks

In [47]:
filter_=df['PERSONNEL_SKILLS']=='Fireworks'
df.loc[filter_,'FELLOW*SHIP*ID']=1014
df

  FELLOW*SHIP*ID FIRST*NAME PERSONNEL_SKILLS
0           1000      Ramzi    data analysis
1           1002    hadrouk        Gardening
2           1003    Gandalf           Spells
3           1014     Pippin        Fireworks

In [57]:
df['FIRST*NAME'] = df['FIRST*NAME'].str.lower()
df['PERSONNEL_SKILLS'] = df['PERSONNEL_SKILLS'].str.lower()
df

  FELLOW*SHIP*ID FIRST*NAME PERSONNEL_SKILLS
0           1000      ramzi    data analysis
1           1002    hadrouk        gardening
2           1003    gandalf           spells
3           1014     pippin        fireworks